module.exports = {
	// يمكنك تخصيص اللغة هنا أو مباشرة في ملفات الأوامر
	onlyadminbox: {
		description: "تشغيل/إيقاف وضع يمكن فيه لمسؤولي المجموعة فقط استخدام البوت",
		guide: "   {pn} [on | off]",
		text: {
			turnedOn: "تم تشغيل وضع يمكن فيه لمسؤولي المجموعة فقط استخدام البوت",
			turnedOff: "تم إيقاف وضع يمكن فيه لمسؤولي المجموعة فقط استخدام البوت",
			syntaxError: "خطأ في الصياغة، استخدم {pn} on أو {pn} off فقط"
		}
	},
	adduser: {
		description: "إضافة مستخدم إلى محادثة المجموعة الخاصة بك",
		guide: "   {pn} [رابط الملف الشخصي | uid]",
		text: {
			alreadyInGroup: "موجود بالفعل في المجموعة",
			successAdd: "- تمت إضافة %1 أعضاء بنجاح إلى المجموعة",
			failedAdd: "- فشل في إضافة %1 أعضاء إلى المجموعة",
			approve: "- تمت إضافة %1 أعضاء إلى قائمة الموافقة",
			invalidLink: "الرجاء إدخال رابط فيسبوك صالح",
			cannotGetUid: "لا يمكن الحصول على uid لهذا المستخدم",
			linkNotExist: "عنوان URL لهذا الملف الشخصي غير موجود",
			cannotAddUser: "البوت محظور أو هذا المستخدم يمنع الغرباء من إضافته إلى المجموعة"
		}
	},
	admin: {
		description: "إضافة، إزالة، تعديل دور المسؤول",
		guide: "   {pn} [add | -a] <uid>: إضافة دور مسؤول للمستخدم\n\t  {pn} [remove | -r] <uid>: إزالة دور المسؤول للمستخدم\n\t  {pn} [list | -l]: عرض قائمة جميع المسؤولين",
		text: {
			added: "✅ | تمت إضافة دور المسؤول لـ %1 مستخدمين:\n%2",
			alreadyAdmin: "\n⚠️ | %1 مستخدمين لديهم بالفعل دور المسؤول:\n%2",
			missingIdAdd: "⚠️ | الرجاء إدخال ID أو عمل إشارة للمستخدم لإضافة دور المسؤول",
			removed: "✅ | تمت إزالة دور المسؤول لـ %1 مستخدمين:\n%2",
			notAdmin: "⚠️ | %1 مستخدمين ليس لديهم دور المسؤول:\n%2",
			missingIdRemove: "⚠️ | الرجاء إدخال ID أو عمل إشارة للمستخدم لإزالة دور المسؤول",
			listAdmin: "👑 | قائمة المسؤولين:\n%1"
		}
	},
	adminonly: {
		description: "تشغيل/إيقاف وضع يمكن فيه للمسؤول فقط استخدام البوت",
		guide: "{pn} [on | off]",
		text: {
			turnedOn: "تم تشغيل وضع يمكن فيه للمسؤول فقط استخدام البوت",
			turnedOff: "تم إيقاف وضع يمكن فيه للمسؤول فقط استخدام البوت",
			syntaxError: "خطأ في الصياغة، استخدم {pn} on أو {pn} off فقط"
		}
	},
	all: {
		description: "عمل إشارة لجميع الأعضاء في محادثة المجموعة الخاصة بك",
		guide: "{pn} [محتوى | فارغ]"
	},
	anime: {
		description: "صورة أنمي عشوائية",
		guide: "{pn} <endpoint>\n   قائمة الـ endpoint: neko, kitsune, hug, pat, waifu, cry, kiss, slap, smug, punch",
		text: {
			loading: "جاري تهيئة الصورة، يرجى الانتظار...",
			error: "حدث خطأ، يرجى المحاولة مرة أخرى لاحقًا"
		}
	},
	antichangeinfobox: {
		description: "تشغيل/إيقاف الحماية من تغيير معلومات المجموعة",
		guide: "   {pn} avt [on | off]: حماية تغيير الصورة الرمزية للمجموعة\n   {pn} name [on | off]: حماية تغيير اسم المجموعة\n   {pn} theme [on | off]: حماية تغيير ثيم المجموعة\n   {pn} emoji [on | off]: حماية تغيير إيموجي المجموعة",
		text: {
			antiChangeAvatarOn: "تشغيل حماية تغيير الصورة الرمزية للمجموعة",
			antiChangeAvatarOff: "إيقاف حماية تغيير الصورة الرمزية للمجموعة",
			missingAvt: "لم تقم بتعيين صورة رمزية للمجموعة",
			antiChangeNameOn: "تشغيل حماية تغيير اسم المجموعة",
			antiChangeNameOff: "إيقاف حماية تغيير اسم المجموعة",
			antiChangeThemeOn: "تشغيل حماية تغيير ثيم المجموعة",
			antiChangeThemeOff: "إيقاف حماية تغيير ثيم المجموعة",
			antiChangeEmojiOn: "تشغيل حماية تغيير إيموجي المجموعة",
			antiChangeEmojiOff: "إيقاف حماية تغيير إيموجي المجموعة",
			antiChangeAvatarAlreadyOn: "مجموعة الدردشة الخاصة بك قيد تشغيل حماية تغيير الصورة الرمزية حاليًا",
			antiChangeNameAlreadyOn: "مجموعة الدردشة الخاصة بك قيد تشغيل حماية تغيير الاسم حاليًا",
			antiChangeThemeAlreadyOn: "مجموعة الدردشة الخاصة بك قيد تشغيل حماية تغيير الثيم حاليًا",
			antiChangeEmojiAlreadyOn: "مجموعة الدردشة الخاصة بك قيد تشغيل حماية تغيير الإيموجي حاليًا"
		}
	},
	appstore: {
		description: "البحث عن تطبيق في متجر التطبيقات",
		text: {
			missingKeyword: "لم تدخل أي كلمة رئيسية",
			noResult: "لم يتم العثور على نتيجة للكلمة الرئيسية %1"
		}
	},
	autosetname: {
		description: "تغيير لقب العضو الجديد تلقائيًا",
		guide: "   {pn} set <اللقب>: يستخدم لتعيين التكوين لتغيير اللقب تلقائيًا، مع بعض الاختصارات:\n   + {userName}: اسم العضو الجديد\n   + {userID}: معرف العضو\n   مثال:\n    {pn} set {userName} 🚀\n\n   {pn} [on | off]: يستخدم لتشغيل/إيقاف هذه الميزة\n\n   {pn} [view | info]: عرض التكوين الحالي",
		text: {
			missingConfig: "الرجاء إدخال التكوين المطلوب",
			configSuccess: "تم تعيين التكوين بنجاح",
			currentConfig: "تكوين autoSetName الحالي في مجموعة الدردشة الخاصة بك هو:\n%1",
			notSetConfig: "لم تقم مجموعتك بتعيين تكوين autoSetName",
			syntaxError: "خطأ في الصياغة، يمكن استخدام \"{pn} on\" أو \"{pn} off\" فقط",
			turnOnSuccess: "تم تشغيل ميزة autoSetName",
			turnOffSuccess: "تم إيقاف ميزة autoSetName",
			error: "حدث خطأ أثناء استخدام ميزة autoSetName، حاول إيقاف ميزة رابط الدعوة في المجموعة وحاول مرة أخرى لاحقًا"
		}
	},
	avatar: {
		description: "إنشاء صورة رمزية أنمي مع توقيع",
		guide: "{p}{n} <معرف الشخصية أو اسمها> | <نص الخلفية> | <التوقيع> | <اسم لون الخلفية أو كود hex>\n{p}{n} help: عرض كيفية استخدام هذا الأمر",
		text: {
			initImage: "جاري تهيئة الصورة، يرجى الانتظار...",
			invalidCharacter: "حاليًا لا يوجد سوى %1 شخصية على النظام، يرجى إدخال معرف شخصية أقل من",
			notFoundCharacter: "لم يتم العثور على شخصية باسم %1 في قائمة الشخصيات",
			errorGetCharacter: "حدث خطأ أثناء الحصول على بيانات الشخصية:\n%1: %2",
			success: "✅ صورتك الرمزية\nالشخصية: %1\nالمعرف: %2\nنص الخلفية: %3\nالتوقيع: %4\nاللون: %5",
			defaultColor: "افتراضي",
			error: "حدث خطأ\n%1: %2"
		}
	},
	badwords: {
		description: "تشغيل/إيقاف/إضافة/إزالة تحذير الكلمات السيئة، إذا انتهك عضو ما، فسيتم تحذيره، وفي المرة الثانية سيتم طرده من صندوق الدردشة",
		guide: "   {pn} add <كلمات>: إضافة كلمات محظورة (يمكنك إضافة كلمات متعددة مفصولة بفواصل \",\" أو أشرطة عمودية \"|\")\n   {pn} delete <كلمات>: حذف كلمات محظورة (يمكنك حذف كلمات متعددة مفصولة بفواصل \",\" أو أشرطة عمودية \"|\")\n   {pn} list <hide | اترك فارغًا>: إيقاف التحذير (أضف \"hide\" لإخفاء الكلمات المحظورة)\n   {pn} unwarn [<userID> | <@tag>]: إزالة تحذير واحد لعضو واحد\n   {pn} on: إيقاف التحذير\n   {pn} off: تشغيل التحذير",
		text: {
			onText: "تشغيل",
			offText: "إيقاف",
			onlyAdmin: "⚠️ | يمكن للمسؤولين فقط إضافة كلمات محظورة إلى القائمة",
			missingWords: "⚠️ | لم تدخل الكلمات المحظورة",
			addedSuccess: "✅ | تمت إضافة %1 كلمة محظورة إلى القائمة",
			alreadyExist: "❌ | %1 كلمة محظورة موجودة بالفعل في القائمة من قبل: %2",
			tooShort: "⚠️ | لا يمكن إضافة %1 كلمة محظورة إلى القائمة لأنها أقصر من حرفين: %2",
			onlyAdmin2: "⚠️ | يمكن للمسؤولين فقط حذف الكلمات المحظورة من القائمة",
			missingWords2: "⚠️ | لم تدخل الكلمات التي تريد حذفها",
			deletedSuccess: "✅ | تم حذف %1 كلمة محظورة من القائمة",
			notExist: "❌ | %1 كلمة محظورة غير موجودة في القائمة من قبل: %2",
			emptyList: "⚠️ | قائمة الكلمات المحظورة في مجموعتك فارغة حاليًا",
			badWordsList: "📑 | قائمة الكلمات المحظورة في مجموعتك: %1",
			onlyAdmin3: "⚠️ | يمكن للمسؤولين فقط %1 هذه الميزة",
			turnedOnOrOff: "✅ | تم %1 تحذير الكلمات المحظورة",
			onlyAdmin4: "⚠️ | يمكن للمسؤولين فقط حذف تحذير الكلمات المحظورة",
			missingTarget: "⚠️ | لم تدخل معرف المستخدم أو لم تشر إلى المستخدم",
			notWarned: "⚠️ | لم يتم تحذير المستخدم %1 بسبب الكلمات المحظورة",
			removedWarn: "✅ | تمت إزالة تحذير واحد للكلمات المحظورة للمستخدم %1 | %2",
			warned: "⚠️ | تم اكتشاف الكلمات المحظورة \"%1\" في رسالتك، إذا واصلت الانتهاك فسيتم طردك من المجموعة.",
			warned2: "⚠️ | تم اكتشاف الكلمات المحظورة \"%1\" في رسالتك، لقد انتهكت مرتين وسيتم طردك من المجموعة.",
			needAdmin: "يحتاج البوت إلى امتيازات المسؤول لطرد الأعضاء المحظورين",
			unwarned: "✅ | تمت إزالة تحذير الكلمات المحظورة للمستخدم %1 | %2"
		}
	},
	balance: {
		description: "عرض أموالك أو أموال الشخص المشار إليه",
		guide: "   {pn}: عرض أموالك\n   {pn} <@tag>: عرض أموال الشخص المشار إليه",
		text: {
			money: "لديك %1$",
			moneyOf: "%1 لديه %2$"
		}
	},
	batslap: {
		description: "صورة باتسلاب",
		text: {
			noTag: "يجب عليك الإشارة إلى الشخص الذي تريد صفعه"
		}
	},
	busy: {
		description: "تشغيل وضع عدم الإزعاج، عندما يتم الإشارة إليك سيقوم البوت بإعلامك",
		guide: "   {pn} [فارغ | <سبب>]: تشغيل وضع عدم الإزعاج\n   {pn} off: إيقاف وضع عدم الإزعاج",
		text: {
			turnedOff: "✅ | تم إيقاف وضع عدم الإزعاج",
			turnedOn: "✅ | تم تشغيل وضع عدم الإزعاج",
			turnedOnWithReason: "✅ | تم تشغيل وضع عدم الإزعاج بسبب: %1",
			alreadyOn: "المستخدم %1 مشغول حاليًا",
			alreadyOnWithReason: "المستخدم %1 مشغول حاليًا بسبب: %2"
		}
	},
	callad: {
		description: "إرسال تقرير، ملاحظات، خطأ، ... إلى مسؤول البوت",
		guide: "   {pn} <رسالة>",
		text: {
			missingMessage: "الرجاء إدخال الرسالة التي تريد إرسالها إلى المسؤول",
			sendByGroup: "\n- أرسلت من المجموعة: %1\n- معرف المحادثة: %2",
			sendByUser: "\n- أرسلت من قبل المستخدم",
			content: "\n\nالمحتوى:\n─────────────────\n%1\n─────────────────\nالرد على هذه الرسالة لإرسال رسالة إلى المستخدم",
			success: "تم إرسال رسالتك إلى المسؤول بنجاح!",
			reply: "📍 رد من المسؤول %1:\n─────────────────\n%2\n─────────────────\nالرد على هذه الرسالة لمواصلة إرسال رسالة إلى المسؤول",
			replySuccess: "تم إرسال ردك إلى المسؤول بنجاح!",
			feedback: "📝 ملاحظات من المستخدم %1:\n- معرف المستخدم: %2%3\n\nالمحتوى:\n─────────────────\n%4\n─────────────────\nالرد على هذه الرسالة لإرسال رسالة إلى المستخدم",
			replyUserSuccess: "تم إرسال ردك إلى المستخدم بنجاح!"
		}
	},
	cmd: {
		description: "إدارة ملفات الأوامر الخاصة بك",
		guide: "{pn} load <اسم ملف الأمر>\n{pn} loadAll\n{pn} install <url> <اسم ملف الأمر>: تنزيل وتثبيت ملف أمر من عنوان url، url هو مسار الملف (raw)",
		text: {
			missingFileName: "⚠️ | الرجاء إدخال اسم الأمر الذي تريد إعادة تحميله",
			loaded: "✅ | تم تحميل الأمر \"%1\" بنجاح",
			loadedError: "❌ | فشل تحميل الأمر \"%1\" مع الخطأ\n%2: %3",
			loadedSuccess: "✅ | تم تحميل الأمر \"%1\" بنجاح",
			loadedFail: "❌ | فشل تحميل الأمر \"%1\"\n%2",
			missingCommandNameUnload: "⚠️ | الرجاء إدخال اسم الأمر الذي تريد إلغاء تحميله",
			unloaded: "✅ | تم إلغاء تحميل الأمر \"%1\" بنجاح",
			unloadedError: "❌ | فشل إلغاء تحميل الأمر \"%1\" مع الخطأ\n%2: %3",
			missingUrlCodeOrFileName: "⚠️ | الرجاء إدخال عنوان url أو الكود واسم ملف الأمر الذي تريد تثبيته",
			missingUrlOrCode: "⚠️ | الرجاء إدخال عنوان url أو كود ملف الأمر الذي تريد تثبيته",
			missingFileNameInstall: "⚠️ | الرجاء إدخال اسم الملف لحفظ الأمر (مع امتداد .js)",
			invalidUrlOrCode: "⚠️ | غير قادر على الحصول على كود الأمر",
			alreadExist: "⚠️ | ملف الأمر موجود بالفعل، هل أنت متأكد من أنك تريد الكتابة فوق ملف الأمر القديم؟\nتفاعل مع هذه الرسالة للمتابعة",
			installed: "✅ | تم تثبيت الأمر \"%1\" بنجاح، تم حفظ ملف الأمر في %2",
			installedError: "❌ | فشل تثبيت الأمر \"%1\" مع الخطأ\n%2: %3",
			missingFile: "⚠️ | لم يتم العثور على ملف الأمر \"%1\"",
			invalidFileName: "⚠️ | اسم ملف الأمر غير صالح",
			unloadedFile: "✅ | تم إلغاء تحميل الأمر \"%1\""
		}
	},
	count: {
		description: "عرض عدد رسائل جميع الأعضاء أو نفسك (منذ انضمام البوت إلى المجموعة)",
		guide: "   {pn}: يستخدم لعرض عدد رسائلك\n   {pn} @tag: يستخدم لعرض عدد رسائل المشار إليهم\n   {pn} all: يستخدم لعرض عدد رسائل جميع الأعضاء",
		text: {
			count: "عدد رسائل الأعضاء:",
			endMessage: "أولئك الذين ليس لديهم اسم في القائمة لم يرسلوا أي رسائل.",
			page: "صفحة [%1/%2]",
			reply: "الرد على هذه الرسالة برقم الصفحة لعرض المزيد",
			result: "%1 في المرتبة %2 مع %3 رسالة",
			yourResult: "أنت في المرتبة %1 وقد أرسلت %2 رسالة في هذه المجموعة",
			invalidPage: "رقم الصفحة غير صالح"
		}
	},
	customrankcard: {
		description: "صمم بطاقة الترتيب بنفسك",
		guide: {
			body: "   {pn} [maincolor | subcolor | linecolor | progresscolor | alphasubcolor | textcolor | namecolor | expcolor | rankcolor | levelcolor | reset] <value>"
				+ "\n   حيث: "
				+ "\n  + maincolor | background <value>: الخلفية الرئيسية لبطاقة الترتيب"
				+ "\n  + subcolor <value>: الخلفية الفرعية"
				+ "\n  + linecolor <value>: لون الخط الفاصل بين الخلفية الرئيسية والفرعية"
				+ "\n  + expbarcolor <value>: لون شريط الخبرة"
				+ "\n  + progresscolor <value>: لون شريط الخبرة الحالي"
				+ "\n  + alphasubcolor <value>: شفافية الخلفية الفرعية (من 0 إلى 1)"
				+ "\n  + textcolor <value>: لون النص (لون hex أو rgba)"
				+ "\n  + namecolor <value>: لون الاسم"
				+ "\n  + expcolor <value>: لون الخبرة"
				+ "\n  + rankcolor <value>: لون الترتيب"
				+ "\n  + levelcolor <value>: لون المستوى"
				+ "\n    • <value> يمكن أن يكون لون hex، rgb، rgba، تدرج (كل لون مفصول بمسافة) أو رابط صورة"
				+ "\n    • إذا كنت تريد استخدام التدرج، يرجى إدخال العديد من الألوان مفصولة بمسافة"
				+ "\n   {pn} reset: إعادة تعيين الكل إلى الإعدادات الافتراضية"
				+ "\n   مثال:"
				+ "\n    {pn} maincolor #fff000"
				+ "\n    {pn} subcolor rgba(255,136,86,0.4)"
				+ "\n    {pn} reset",
			attachment: {
				[`${process.cwd()}/scripts/cmds/assets/guide/customrankcard_1.jpg`]: "https://i.ibb.co/BZ2Qgs1/image.png",
				[`${process.cwd()}/scripts/cmds/assets/guide/customrankcard_2.png`]: "https://i.ibb.co/wy1ZHHL/image.png"
			}
		},
		text: {
			invalidImage: "رابط الصورة غير صالح، يرجى اختيار رابط صورة بوجهة صورة (jpg, jpeg, png, gif)، يمكنك رفع الصورة إلى https://imgbb.com/ واختيار \"get direct link\" للحصول على رابط الصورة",
			invalidAttachment: "مرفق غير صالح، يرجى اختيار ملف صورة",
			invalidColor: "رمز اللون غير صالح، يرجى اختيار رمز لون hex (6 أرقام) أو رمز لون rgba",
			notSupportImage: "رابط الصورة غير مدعوم مع الخيار \"%1\"",
			success: "تم حفظ تغييراتك، إليك معاينة",
			reseted: "تمت إعادة تعيين جميع الإعدادات إلى الإعدادات الافتراضية",
			invalidAlpha: "الرجاء اختيار رقم من 0 إلى 1"
		}
	},
	dhbc: {
		description: "العب لعبة تخمين الكلمة",
		guide: "{pn}",
		text: {
			reply: "الرجاء الرد على هذه الرسالة بالإجابة\n%1",
			isSong: "هذا هو اسم أغنية المطرب %1",
			notPlayer: "⚠️ أنت لست لاعب هذا السؤال",
			correct: "🎉 تهانينا لقد أجبت بشكل صحيح وحصلت على %1$",
			wrong: "⚠️ لقد أجبت بشكل غير صحيح"
		}
	},
	emojimix: {
		description: "اخلط 2 إيموجي معًا",
		guide: "   {pn} <emoji1> <emoji2>\n   مثال:  {pn} 🤣 🥰"
	},
	eval: {
		description: "اختبار الكود بسرعة",
		guide: "{pn} <الكود للاختبار>",
		text: {
			error: "❌ حدث خطأ:"
		}
	},
	event: {
		description: "إدارة ملفات أوامر الأحداث الخاصة بك",
		guide: "{pn} load <اسم ملف الأمر>\n{pn} loadAll\n{pn} install <url> <اسم ملف الأمر>: تنزيل وتحميل أمر حدث، url هو مسار ملف الأمر (raw)",
		text: {
			missingFileName: "⚠️ | الرجاء إدخال اسم الأمر الذي تريد إعادة تحميله",
			loaded: "✅ | تم تحميل أمر الحدث \"%1\" بنجاح",
			loadedError: "❌ | فشل تحميل أمر الحدث \"%1\" مع الخطأ\n%2: %3",
			loadedSuccess: "✅ | تم تحميل أمر الحدث \"%1\" بنجاح",
			loadedFail: "❌ | فشل تحميل أمر الحدث \"%1\"\n%2",
			missingCommandNameUnload: "⚠️ | الرجاء إدخال اسم الأمر الذي تريد إلغاء تحميله",
			unloaded: "✅ | تم إلغاء تحميل أمر الحدث \"%1\" بنجاح",
			unloadedError: "❌ | فشل إلغاء تحميل أمر الحدث \"%1\" مع الخطأ\n%2: %3",
			missingUrlCodeOrFileName: "⚠️ | الرجاء إدخال عنوان url أو الكود واسم ملف الأمر الذي تريد تثبيته",
			missingUrlOrCode: "⚠️ | الرجاء إدخال عنوان url أو كود ملف الأمر الذي تريد تثبيته",
			missingFileNameInstall: "⚠️ | الرجاء إدخال اسم الملف لحفظ الأمر (مع امتداد .js)",
			invalidUrlOrCode: "⚠️ | غير قادر على الحصول على كود الأمر",
			alreadExist: "⚠️ | ملف الأمر موجود بالفعل، هل أنت متأكد من أنك تريد الكتابة فوق ملف الأمر القديم؟\nتفاعل مع هذه الرسالة للمتابعة",
			installed: "✅ | تم تثبيت أمر الحدث \"%1\" بنجاح، تم حفظ ملف الأمر في %2",
			installedError: "❌ | فشل تثبيت أمر الحدث \"%1\" مع الخطأ\n%2: %3",
			missingFile: "⚠️ | لم يتم العثور على الملف \"%1\"",
			invalidFileName: "⚠️ | اسم ملف غير صالح",
			unloadedFile: "✅ | تم إلغاء تحميل الأمر \"%1\""
		}
	},
	filteruser: {
		description: "تصفية أعضاء المجموعة حسب عدد الرسائل أو الحسابات المقفلة",
		guide: "   {pn} [<عدد الرسائل> | die]",
		text: {
			needAdmin: "⚠️ | الرجاء إضافة البوت كمسؤول للمجموعة لاستخدام هذا الأمر",
			confirm: "⚠️ | هل أنت متأكد من أنك تريد حذف أعضاء المجموعة الذين لديهم أقل من %1 رسالة؟\nتفاعل مع هذه الرسالة للتأكيد",
			kickByBlock: "✅ | تم حذف %1 عضوًا لديهم حسابات مقفلة بنجاح",
			kickByMsg: "✅ | تم حذف %1 عضوًا لديهم أقل من %2 رسالة بنجاح",
			kickError: "❌ | حدث خطأ ولم يتمكن من طرد %1 عضوًا:\n%2",
			noBlock: "✅ | لا يوجد أعضاء لديهم حسابات مقفلة",
			noMsg: "✅ | لا يوجد أعضاء لديهم أقل من %1 رسالة"
		}
	},
	getfbstate: {
		description: "الحصول على fbstate الحالي",
		guide: "{pn}",
		text: {
			success: "تم إرسال fbstate إليك، يرجى التحقق من الرسالة الخاصة للبوت"
		}
	},
	grouptag: {
		description: "عمل إشارة للأعضاء حسب المجموعة",
		guide: "   {pn} add <groupTagName> <@tags>: يستخدم لإضافة مجموعة إشارة جديدة أو إضافة أعضاء إلى مجموعة إشارة\n   مثال:\n    {pn} TEAM1 @tag1 @tag2\n\n   {pn} del <groupTagName> <@tags>: يستخدم لإزالة أعضاء من مجموعة إشارة\n   مثال:\n    {pn} del TEAM1 @tag1 @tag2\n\n   {pn} remove <groupTagName>: يستخدم لإزالة مجموعة إشارة\n   مثال:\n    {pn} remove TEAM1\n\n   {pn} rename <groupTagName> | <newGroupTagName>: يستخدم لإعادة تسمية مجموعة إشارة\n\n   {pn} [list | all]: يستخدم لعرض قائمة مجموعات الإشارة في محادثة المجموعة الخاصة بك\n\n   {pn} info <groupTagName>: يستخدم لعرض معلومات مجموعة الإشارة",
		text: {
			noGroupTagName: "الرجاء إدخال اسم مجموعة الإشارة",
			noMention: "لم تقم بالإشارة إلى أي عضو لإضافته إلى مجموعة الإشارة",
			addedSuccess: "تمت إضافة الأعضاء:\n%1\nإلى مجموعة الإشارة \"%2\"",
			addedSuccess2: "تمت إضافة مجموعة الإشارة \"%1\" مع الأعضاء:\n%2",
			existedInGroupTag: "الأعضاء:\n%1\nموجودون بالفعل في مجموعة الإشارة \"%2\"",
			notExistedInGroupTag: "الأعضاء:\n%1\nغير موجودين في مجموعة الإشارة \"%2\"",
			noExistedGroupTag: "مجموعة الإشارة \"%1\" غير موجودة في محادثة المجموعة الخاصة بك",
			noExistedGroupTag2: "لم تقم محادثة المجموعة الخاصة بك بإضافة أي مجموعة إشارة",
			noMentionDel: "الرجاء الإشارة إلى الأعضاء لإزالتهم من مجموعة الإشارة \"%1\"",
			deletedSuccess: "تم حذف الأعضاء:\n%1\nمن مجموعة الإشارة \"%2\"",
			deletedSuccess2: "تم حذف مجموعة الإشارة \"%1\"",
			tagged: "إشارة إلى المجموعة \"%1\":\n%2",
			noGroupTagName2: "الرجاء إدخال اسم مجموعة الإشارة القديم والجديد، مفصولين بـ \"|\"",
			renamedSuccess: "تمت إعادة تسمية مجموعة الإشارة \"%1\" إلى \"%2\"",
			infoGroupTag: "📑 | اسم المجموعة: \"%1\"\n👥 | عدد الأعضاء: %2\n👨‍👩‍👧‍👦 | قائمة الأعضاء:\n %3"
		}
	},
	help: {
		description: "عرض استخدام الأوامر",
		guide: "{pn} [فارغ | <رقم الصفحة> | <اسم الأمر>]",
		text: {
			help: "╭─────────────⭓\n%1\n├─────⭔\n│ صفحة [ %2/%3 ]\n│ حاليًا، لدى البوت %4 أمرًا يمكن استخدامها\n│ » اكتب %5help <page> لعرض قائمة الأوامر\n│ » اكتب %5help لعرض تفاصيل كيفية استخدام هذا الأمر\n├────────⭔\n│ %6\n╰─────────────⭓",
			help2: "%1├───────⭔\n│ » حاليًا، لدى البوت %2 أمرًا يمكن استخدامها\n│ » اكتب %3help <اسم الأمر> لعرض تفاصيل كيفية استخدام هذا الأمر\n│ %4\n╰─────────────⭓",
			commandNotFound: "الأمر \"%1\" غير موجود",
			getInfoCommand: "╭── الاسم ────⭓\n│ %1\n├── معلومات\n│ الوصف: %2\n│ أسماء أخرى: %3\n│ أسماء أخرى في مجموعتك: %4\n│ الإصدار: %5\n│ الدور: %6\n│ الوقت لكل أمر: %7 ثانية\n│ المؤلف: %8\n├── الاستخدام\n%9\n├── ملاحظات\n│ يمكن تغيير المحتوى داخل <XXXXX>\n│ المحتوى داخل [a|b|c] هو a أو b أو c\n╰──────⭔",
			doNotHave: "لا يوجد",
			roleText0: "0 (جميع المستخدمين)",
			roleText1: "1 (مسؤولو المجموعة)",
			roleText2: "2 (مسؤول البوت)",
			roleText0setRole: "0 (تعيين الدور، جميع المستخدمين)",
			roleText1setRole: "1 (تعيين الدور، مسؤولو المجموعة)",
			pageNotFound: "الصفحة %1 غير موجودة"
		}
	},
	kick: {
		description: "طرد عضو من صندوق الدردشة",
		guide: "{pn} @tags: يستخدم لطرد الأعضاء المشار إليهم"
	},
	loadconfig: {
		description: "إعادة تحميل تكوين البوت"
	},
	moon: {
		description: "عرض صورة القمر في الليلة التي تختارها (dd/mm/yyyy)",
		guide: "  {pn} <يوم/شهر/سنة>\n   {pn} <يوم/شهر/سنة> <caption>",
		text: {
			invalidDateFormat: "الرجاء إدخال تاريخ صالح بتنسيق DD/MM/YYYY",
			error: "حدث خطأ أثناء الحصول على صورة القمر لـ %1",
			invalidDate: "%1 ليس تاريخًا صالحًا",
			caption: "- صورة القمر في %1"
		}
	},
	notification: {
		description: "إرسال إشعار من المسؤول إلى جميع الصناديق",
		guide: "{pn} <رسالة>",
		text: {
			missingMessage: "الرجاء إدخال الرسالة التي تريد إرسالها إلى جميع المجموعات",
			notification: "إشعار من مسؤول البوت إلى جميع مجموعات الدردشة (لا ترد على هذه الرسالة)",
			sendingNotification: "بدء إرسال إشعار من مسؤول البوت إلى %1 مجموعة دردشة",
			sentNotification: "✅ تم إرسال الإشعار إلى %1 مجموعة بنجاح",
			errorSendingNotification: "حدث خطأ أثناء الإرسال إلى %1 مجموعة:\n %2"
		}
	},
	prefix: {
		description: "تغيير بادئة الأوامر للبوت في صندوق الدردشة الخاص بك أو في نظام البوت بأكمله (مسؤول البوت فقط)",
		guide: "   {pn} <بادئة جديدة>: تغيير البادئة الجديدة في صندوق الدردشة الخاص بك\n   مثال:\n    {pn} #\n\n   {pn} <بادئة جديدة> -g: تغيير البادئة الجديدة في نظام البوت (مسؤول البوت فقط)\n   مثال:\n    {pn} # -g\n\n   {pn} reset: تغيير البادئة في صندوق الدردشة الخاص بك إلى الإعدادات الافتراضية",
		text: {
			reset: "تمت إعادة تعيين البادئة الخاصة بك إلى الإعدادات الافتراضية: %1",
			onlyAdmin: "يمكن للمسؤول فقط تغيير بادئة نظام البوت",
			confirmGlobal: "الرجاء التفاعل مع هذه الرسالة لتأكيد تغيير بادئة نظام البوت",
			confirmThisThread: "الرجاء التفاعل مع هذه الرسالة لتأكيد تغيير البادئة في صندوق الدردشة الخاص بك",
			successGlobal: "تم تغيير بادئة نظام البوت إلى: %1",
			successThisThread: "تم تغيير البادئة في صندوق الدردشة الخاص بك إلى: %1",
			myPrefix: "🌐 بادئة النظام: %1\n🛸 بادئة صندوق الدردشة الخاص بك: %2"
		}
	},
	rank: {
		description: "عرض مستواك أو مستوى الشخص المشار إليه. يمكنك الإشارة إلى عدة أشخاص"
	},
	rankup: {
		description: "تشغيل/إيقاف إشعار رفع المستوى",
		guide: "{pn} [on | off]",
		text: {
			syntaxError: "خطأ في الصياغة، استخدم {pn} on أو {pn} off فقط",
			turnedOn: "تم تشغيل إشعار رفع المستوى",
			turnedOff: "تم إيقاف إشعار رفع المستوى",
			notiMessage: "🎉🎉 تهانينا على الوصول إلى المستوى %1"
		}
	},
	refresh: {
		description: "تحديث معلومات مجموعة الدردشة أو المستخدم",
		guide: "   {pn} [thread | group]: تحديث معلومات مجموعة الدردشة الخاصة بك\n   {pn} group <threadID>: تحديث معلومات مجموعة الدردشة حسب المعرف\n\n   {pn} user: تحديث معلومات المستخدم الخاصة بك\n   {pn} user [<userID> | @tag]: تحديث معلومات المستخدم حسب المعرف",
		text: {
			refreshMyThreadSuccess: "✅ | تم تحديث معلومات مجموعة الدردشة الخاصة بك بنجاح!",
			refreshThreadTargetSuccess: "✅ | تم تحديث معلومات مجموعة الدردشة %1 بنجاح!"
		}
	},
	rules: {
		description: "إنشاء/عرض/إضافة/تعديل/تغيير موضع/حذف قواعد المجموعة الخاصة بك",
		guide: "   {pn} [add | -a] <القاعدة لإضافتها>: إضافة قاعدة للمجموعة.\n   {pn}: عرض قواعد المجموعة.\n   {pn} [edit | -e] <n> <المحتوى بعد التعديل>: تعديل القاعدة رقم n.\n   {pn} [move | -m] <stt1> <stt2> تبديل موضع القاعدة رقم <stt1> و <stt2>.\n   {pn} [delete | -d] <n>: حذف القاعدة رقم n.\n   {pn} [remove | -r]: حذف جميع قواعد المجموعة.\n\n   مثال:\n    {pn} add لا ترسل رسائل مزعجة\n    {pn} move 1 3\n    {pn} -e 1 لا ترسل رسائل مزعجة في المجموعة\n    {pn} -r"
	},
	sendnoti: {
		description: "إنشاء وإرسال إشعارات إلى المجموعات التي تديرها",
		guide: "   {pn} create <groupName>: إنشاء مجموعة إشعارات جديدة بالاسم <groupName>\n   مثال:\n    {pn} create TEAM1\n\n   {pn} add <groupName>: إضافة صندوق الدردشة الحالي إلى مجموعة الإشعارات <groupName> (يجب أن تكون مسؤولاً عن صندوق الدردشة هذا)\n   مثال:\n    {pn} add TEAM1\n\n   {pn} delete: إزالة صندوق الدردشة الحالي من مجموعة الإشعارات <groupName> (يجب أن تكون منشئ هذه المجموعة)\n   مثال:\n    {pn} delete TEAM1\n\n   {pn} send <groupName> | <رسالة>: إرسال إشعار إلى جميع المجموعات في مجموعة الإشعارات <groupName> (يجب أن تكون مسؤولاً عن تلك المجموعات)\n   مثال:\n    {pn} remove TEAM1\n\n   {pn} remove <groupName>: إزالة مجموعة الإشعارات <groupName> (يجب أن تكون منشئ مجموعة الإشعارات <groupName>)\n   مثال:\n    {pn} remove TEAM1",
		text: {
			missingGroupName: "الرجاء إدخال اسم groupNoti",
			groupNameExists: "تم إنشاء مجموعة إشعارات بالاسم %1 من قبلك من قبل، يرجى اختيار اسم آخر",
			createdGroup: "تم إنشاء مجموعة إشعارات بنجاح:\n- الاسم: %1\n- المعرف: %2",
			missingGroupNameToAdd: "الرجاء إدخال اسم groupNoti الذي تريد إضافة مجموعة الدردشة هذه إليه",
			groupNameNotExists: "لم تقم بإنشاء/إدارة أي مجموعة إشعارات بالاسم: %1",
			notAdmin: "أنت لست مسؤولاً عن مجموعة الدردشة هذه",
			added: "تمت إضافة مجموعة الدردشة الحالية إلى مجموعة الإشعارات: %1",
			missingGroupNameToDelete: "الرجاء إدخال اسم groupNoti الذي تريد حذف مجموعة الدردشة هذه من القائمة",
			notInGroup: "مجموعة الدردشة الحالية ليست في مجموعة الإشعارات %1",
			deleted: "تم حذف مجموعة الدردشة الحالية من مجموعة الإشعارات: %1",
			failed: "فشل إرسال الإشعار إلى %1 مجموعة دردشة: \n%2",
			missingGroupNameToRemove: "الرجاء إدخال اسم groupNoti الذي تريد إزالته",
			removed: "تمت إزالة مجموعة الإشعارات: %1",
			missingGroupNameToSend: "الرجاء إدخال اسم groupNoti الذي تريد إرسال رسالة إليه",
			groupIsEmpty: "مجموعة الإشعارات \"%1\" فارغة",
			sending: "جاري إرسال الإشعار إلى %1 مجموعة دردشة",
			success: "تم إرسال الإشعار إلى %1 مجموعة دردشة في مجموعة الإشعارات \"%2\" بنجاح",
			notAdminOfGroup: "أنت لست مسؤولاً عن هذه المجموعة",
			missingGroupNameToView: "الرجاء إدخال اسم groupNoti الذي تريد عرض معلوماته",
			groupInfo: "- اسم المجموعة: %1\n - المعرف: %2\n - تم إنشاؤه في: %3\n%4 ",
			groupInfoHasGroup: "- يحتوي على مجموعات دردشة: \n%1",
			noGroup: "لم تقم بإنشاء/إدارة أي مجموعة إشعارات"
		}
	},
	setalias: {
		description: "إضافة اسم مستعار لأي أمر في مجموعتك",
		guide: "  يستخدم هذا الأمر لإضافة/إزالة اسم مستعار لأي أمر في مجموعتك\n   {pn} add <alias> <command>: إضافة اسم مستعار للأمر في مجموعتك\n   {pn} add <alias> <command> -g: إضافة اسم مستعار للأمر في النظام بأكمله (مسؤول البوت فقط)\nمثال:\n    {pn} add ctrk customrankcard\n\n   {pn} [remove | rm] <alias> <command>: إزالة اسم مستعار للأمر في مجموعتك\n   {pn} [remove | rm] <alias> <command> -g: إزالة اسم مستعار للأمر في النظام بأكمله (مسؤول البوت فقط)\nمثال:\n    {pn} rm ctrk customrankcard\n\n   {pn} list: عرض قائمة جميع الأسماء المستعارة للأوامر في مجموعتك\n   {pn} list -g: عرض قائمة جميع الأسماء المستعارة للأوامر في النظام بأكمله"
	},
	setavt: {
		description: "تغيير الصورة الرمزية للبوت",
		text: {
			cannotGetImage: "❌ | حدث خطأ أثناء الاستعلام عن رابط الصورة",
			invalidImageFormat: "❌ | تنسيق الصورة غير صالح",
			changedAvatar: "✅ | تم تغيير الصورة الرمزية للبوت بنجاح"
		}
	},
	setlang: {
		description: "تعيين اللغة الافتراضية للبوت للمحادثة الحالية أو جميع المحادثات",
		guide: "   {pn} <رمز اللغة ISO 639-1\n   مثال:    {pn} en    {pn} vi    {pn} ja",
		text: {
			setLangForAll: "تعيين اللغة الافتراضية لجميع المحادثات: %1",
			setLangForCurrent: "تعيين اللغة الافتراضية للمحادثة الحالية: %1",
			noPermission: "يمكن لمسؤول البوت فقط استخدام هذا الأمر"
		}
	},
	setleave: {
		description: "تعديل محتوى/تشغيل/إيقاف رسالة المغادرة عندما يغادر عضو مجموعة الدردشة الخاصة بك",
		guide: {
			body: "   {pn} on: تشغيل رسالة المغادرة\n   {pn} off: إيقاف رسالة المغادرة\n   {pn} text [<المحتوى> | reset]: تعديل محتوى النص أو إعادة التعيين إلى الإعدادات الافتراضية، الاختصارات المتاحة:\n  + {userName}: اسم العضو الذي غادر المجموعة\n  + {userNameTag}: اسم العضو الذي غادر المجموعة (إشارة)\n  + {boxName}: اسم مجموعة الدردشة\n  + {type}: غادر/طرد من قبل المسؤول\n  + {session}: جلسة في اليوم\n\n   مثال:\n    {pn} text {userName} قد {type} المجموعة، نراك مرة أخرى 🤧\n\n   الرد أو إرسال رسالة مع ملف مع محتوى {pn} file: لإضافة ملف مرفق إلى رسالة المغادرة (صورة، فيديو، صوت)\n\nمثال:\n   {pn} file reset: إعادة تعيين الملف",
			attachment: {
				[`${process.cwd()}/scripts/cmds/assets/guide/setleave/setleave_en_1.png`]: "https://i.ibb.co/2FKJHJr/guide1.png"
			}
		},
		text: {
			missingContent: "الرجاء إدخال المحتوى",
			edited: "تم تعديل محتوى رسالة المغادرة لمجموعتك إلى:\n%1",
			reseted: "تمت إعادة تعيين محتوى رسالة المغادرة",
			noFile: "لا يوجد ملف مرفق لرسالة المغادرة لإعادة التعيين",
			resetedFile: "تمت إعادة تعيين ملف مرفق رسالة المغادرة بنجاح",
			missingFile: "الرجاء الرد على هذه الرسالة بملف صورة/فيديو/صوت",
			addedFile: "تمت إضافة %1 ملف مرفق إلى رسالة المغادرة الخاصة بك"
		}
	},
	setname: {
		description: "تغيير لقب جميع الأعضاء في الدردشة أو الأعضاء المشار إليهم بتنسيق معين",
		guide: {
			body: "   {pn} <اللقب>: تغيير لقبك\n   {pn} @tags <اللقب>: تغيير لقب الأعضاء المشار إليهم\n   {pn} all <اللقب>: تغيير لقب جميع الأعضاء في الدردشة\n\nمع الاختصارات المتاحة:\n   + {userName}: اسم العضو\n   + {userID}: معرف العضو\n\n   مثال: (انظر الصورة)",
			attachment: {
				[`${process.cwd()}/scripts/cmds/assets/guide/setname_1.png`]: "https://i.ibb.co/gFh23zb/guide1.png",
				[`${process.cwd()}/scripts/cmds/assets/guide/setname_2.png`]: "https://i.ibb.co/BNWHKgj/guide2.png"
			}
		},
		text: {
			error: "حدث خطأ، حاول إيقاف ميزة رابط الدعوة في المجموعة وحاول مرة أخرى لاحقًا"
		}
	},
	setrole: {
		description: "تعديل دور الأمر (الأوامر التي لها دور < 2)",
		guide: "   {pn} <commandName> <new role>: تعيين دور جديد للأمر\n   مع:\n   + <commandName>: اسم الأمر\n   + <new role>: دور جديد للأمر مع:\n   + <new role> = 0: يمكن استخدام الأمر من قبل جميع الأعضاء في المجموعة\n   + <new role> = 1: يمكن استخدام الأمر من قبل المسؤول فقط\n   + <new role> = default: إعادة تعيين دور الأمر إلى الإعدادات الافتراضية\n   مثال:\n    {pn} rank 1: (يمكن استخدام أمر rank من قبل المسؤول فقط)\n    {pn} rank 0: (يمكن استخدام أمر rank من قبل جميع الأعضاء في المجموعة)\n    {pn} rank default: إعادة التعيين إلى الإعدادات الافتراضية\n—————\n   {pn} [viewrole|view|show]: عرض دور الأوامر المعدلة",
		text: {
			noEditedCommand: "✅ مجموعتك لا تحتوي على أوامر معدلة",
			editedCommand: "⚠️ مجموعتك تحتوي على أوامر معدلة:\n",
			noPermission: "❗ يمكن للمسؤول فقط استخدام هذا الأمر",
			commandNotFound: "الأمر \"%1\" غير موجود",
			noChangeRole: "❗ لا يمكن تغيير دور الأمر \"%1\"",
			resetRole: "إعادة تعيين دور الأمر \"%1\" إلى الإعدادات الافتراضية",
			changedRole: "تم تغيير دور الأمر \"%1\" إلى %2"
		}
	},
	setwelcome: {
		description: "تعديل محتوى رسالة الترحيب عند انضمام عضو جديد إلى مجموعة الدردشة الخاصة بك",
		guide: {
			body: "   {pn} text [<المحتوى> | reset]: تعديل محتوى النص أو إعادة التعيين إلى الإعدادات الافتراضية، مع بعض الاختصارات:\n  + {userName}: اسم العضو الجديد\n  + {userNameTag}: اسم العضو الجديد (إشارة)\n  + {boxName}:  اسم مجموعة الدردشة\n  + {multiple}: أنت || أنتم\n  + {session}:  جلسة في اليوم\n\n   مثال:\n    {pn} text مرحبًا {userName}، أهلاً بك في {boxName}، أتمنى لك يومًا سعيدًا {multiple}\n\n   الرد (phản hồi) أو إرسال رسالة مع ملف مع محتوى {pn} file: لإضافة مرفقات ملف إلى رسالة الترحيب (صورة، فيديو، صوت)\n\n   مثال:\n    {pn} file reset: حذف مرفقات الملف",
			attachment: {
				[`${process.cwd()}/scripts/cmds/assets/guide/setwelcome/setwelcome_en_1.png`]: "https://i.ibb.co/vsCz0ks/setwelcome-en-1.png"
			}
		},
		text: {
			missingContent: "الرجاء إدخال محتوى رسالة الترحيب",
			edited: "تم تعديل محتوى رسالة الترحيب لمجموعتك إلى: %1",
			reseted: "تمت إعادة تعيين محتوى رسالة الترحيب",
			noFile: "لا توجد مرفقات ملف لحذفها",
			resetedFile: "تمت إعادة تعيين مرفقات الملف بنجاح",
			missingFile: "الرجاء الرد على هذه الرسالة بملف صورة/فيديو/صوت",
			addedFile: "تمت إضافة %1 مرفق ملف إلى رسالة ترحيب مجموعتك"
		}
	},
	shortcut: {
		description: "إضافة اختصار لرسالتك في مجموعة الدردشة",
		text: {
			missingContent: 'الرجاء إدخال محتوى الرسالة',
			shortcutExists: 'الاختصار "%1" موجود بالفعل، تفاعل مع هذه الرسالة لاستبدال محتوى الاختصار',
			shortcutExistsByOther: 'تمت إضافة الاختصار %1 من قبل عضو آخر، يرجى تجربة كلمة رئيسية أخرى',
			added: 'تمت إضافة الاختصار %1 => %2',
			addedAttachment: ' مع %1 مرفق(ات)',
			missingKey: 'الرجاء إدخال الكلمة الرئيسية للاختصار الذي تريد حذفه',
			notFound: 'لم يتم العثور على اختصار للكلمة الرئيسية %1 في مجموعة الدردشة الخاصة بك',
			onlyAdmin: 'يمكن للمسؤولين فقط حذف اختصارات الآخرين',
			deleted: 'تم حذف الاختصار %1',
			empty: 'لم تقم مجموعة الدردشة الخاصة بك بإضافة أي اختصارات',
			message: 'رسالة',
			attachment: 'مرفق',
			list: 'قائمة الاختصارات الخاصة بك',
			onlyAdminRemoveAll: 'يمكن للمسؤولين فقط إزالة جميع الاختصارات في مجموعة الدردشة',
			confirmRemoveAll: 'هل أنت متأكد من أنك تريد إزالة جميع الاختصارات في مجموعة الدردشة هذه؟ (تفاعل مع هذه الرسالة للتأكيد)',
			removedAll: 'تمت إزالة جميع الاختصارات في مجموعة الدردشة الخاصة بك'
		}
	},
	simsimi: {
		description: "الدردشة مع simsimi",
		guide: "   {pn} [on | off]: تشغيل/إيقاف simsimi\n\n   {pn} <كلمة>: الدردشة مع simsimi\n   مثال:\n    {pn} hi",
		text: {
			turnedOn: "تم تشغيل simsimi بنجاح!",
			turnedOff: "تم إيقاف simsimi بنجاح!",
			chatting: "جاري الدردشة مع simsimi...",
			error: "Simsimi مشغول، يرجى المحاولة مرة أخرى لاحقًا"
		}
	},
	sorthelp: {
		description: "فرز قائمة المساعدة",
		guide: "{pn} [name | category]",
		text: {
			savedName: "تم حفظ فرز قائمة المساعدة حسب الاسم",
			savedCategory: "تم حفظ فرز قائمة المساعدة حسب الفئة"
		}
	},
	thread: {
		description: "إدارة مجموعة الدردشة في نظام البوت",
		guide: "   {pn} [find | -f | search | -s] <الاسم للبحث>: البحث عن مجموعة دردشة في بيانات البوت بالاسم\n   {pn} [find | -f | search | -s] [-j | joined] <الاسم للبحث>: البحث عن مجموعة دردشة في بيانات البوت التي لا يزال البوت منضمًا إليها بالاسم\n   {pn} [ban | -b] [<tid> | اترك فارغًا] <السبب>: يستخدم لحظر مجموعة بالمعرف <tid> أو المجموعة الحالية التي تستخدم البوت\n   مثال:\n    {pn} ban 3950898668362484 spam bot\n    {pn} ban spam too much\n    {pn} unban [<tid> | اترك فارغًا] لإلغاء حظر المجموعة بالمعرف <tid> أو المجموعة الحالية",
		text: {
			noPermission: "ليس لديك إذن لاستخدام هذه الميزة",
			found: "🔎 تم العثور على %1 مجموعة تطابق الكلمة الرئيسية \"%3\" في بيانات البوت:\n%3",
			notFound: "❌ لم يتم العثور على مجموعة تطابق الكلمة الرئيسية: \"%1\" في بيانات البوت",
			hasBanned: "تم حظر المجموعة بالمعرف [%1 | %2] من قبل:\n» السبب: %3\n» الوقت: %4",
			banned: "تم حظر المجموعة بالمعرف [%1 | %2] من استخدام البوت.\n» السبب: %3\n» الوقت: %4",
			notBanned: "المجموعة بالمعرف [%1 | %2] غير محظورة من استخدام البوت",
			unbanned: "تم إلغاء حظر المجموعة بالمعرف tid [%1 | %2] من استخدام البوت",
			missingReason: "لا يمكن أن يكون سبب الحظر فارغًا",
			info: "» معرف الصندوق: %1\n» الاسم: %2\n» تاريخ إنشاء البيانات: %3\n» إجمالي الأعضاء: %4\n» فتى: %5 أعضاء\n» فتاة: %6 أعضاء\n» إجمالي الرسائل: %7%8"
		}
	},
	tid: {
		description: "عرض معرف المحادثة لمجموعة الدردشة الخاصة بك",
		guide: "{pn}"
	},
	tik: {
		description: "تنزيل الفيديو/الشريحة (صورة)، الصوت من رابط tiktok",
		guide: "   {pn} [video|-v|v] <url>: يستخدم لتنزيل الفيديو/الشريحة (صورة) من رابط tiktok.\n   {pn} [audio|-a|a] <url>: يستخدم لتنزيل الصوت من رابط tiktok",
		text: {
			invalidUrl: "الرجاء إدخال رابط tiktok صالح",
			downloadingVideo: "جاري تنزيل الفيديو: %1...",
			downloadedSlide: "تم تنزيل الشريحة: %1\n%2",
			downloadedVideo: "تم تنزيل الفيديو: %1\nرابط التنزيل: %2",
			downloadingAudio: "جاري تنزيل الصوت: %1...",
			downloadedAudio: "تم تنزيل الصوت: %1"
		}
	},
	trigger: {
		description: "صورة محفزة",
		guide: "{pn} [@tag | فارغ]"
	},
	uid: {
		description: "عرض معرف مستخدم فيسبوك للمستخدم",
		guide: "   {pn}: يستخدم لعرض معرف مستخدم فيسبوك الخاص بك\n   {pn} @tag: عرض معرف مستخدم فيسبوك للأشخاص المشار إليهم\n   {pn} <رابط الملف الشخصي>: عرض معرف مستخدم فيسبوك لرابط الملف الشخصي",
		text: {
			syntaxError: "الرجاء الإشارة إلى الشخص الذي تريد عرض uid الخاص به أو تركه فارغًا لعرض uid الخاص بك"
		}
	},
	unsend: {
		description: "إلغاء إرسال رسالة البوت",
		guide: "الرد على الرسالة التي تريد إلغاء إرسالها واستدعاء الأمر {pn}",
		text: {
			syntaxError: "الرجاء الرد على الرسالة التي تريد إلغاء إرسالها"
		}
	},
	user: {
		description: "إدارة المستخدمين في نظام البوت",
		guide: "   {pn} [find | -f | search | -s] <الاسم للبحث>: البحث عن مستخدمين في بيانات البوت بالاسم\n\n   {pn} [ban | -b] [<uid> | @tag | الرد على رسالة] <السبب>: لحظر مستخدم بالمعرف <uid> أو المستخدم المشار إليه أو مرسل الرسالة التي تم الرد عليها باستخدام البوت\n\n   {pn} unban [<uid> | @tag | الرد على رسالة]: لإلغاء حظر المستخدم باستخدام البوت",
		text: {
			noUserFound: "❌ لم يتم العثور على مستخدم بالاسم المطابق للكلمة الرئيسية: \"%1\" في بيانات البوت",
			userFound: "🔎 تم العثور على %1 مستخدم بالاسم المطابق للكلمة الرئيسية \"%2\" في بيانات البوت:\n%3",
			uidRequired: "لا يمكن أن يكون Uid المستخدم المراد حظره فارغًا، يرجى إدخال uid أو الإشارة إلى مستخدم أو الرد على رسالة مستخدم بواسطة user ban <uid> <reason>",
			reasonRequired: "لا يمكن أن يكون سبب حظر المستخدم فارغًا، يرجى إدخال uid أو الإشارة إلى مستخدم أو الرد على رسالة مستخدم بواسطة user ban <uid> <reason>",
			userHasBanned: "تم حظر المستخدم بالمعرف [%1 | %2] من قبل:\n» السبب: %3\n» التاريخ: %4",
			userBanned: "تم حظر المستخدم بالمعرف [%1 | %2]:\n» السبب: %3\n» التاريخ: %4",
			uidRequiredUnban: "لا يمكن أن يكون Uid المستخدم المراد إلغاء حظره فارغًا",
			userNotBanned: "المستخدم بالمعرف [%1 | %2] غير محظور",
			userUnbanned: "تم إلغاء حظر المستخدم بالمعرف [%1 | %2]"
		}
	},
	videofb: {
		description: "تنزيل الفيديو/القصة من فيسبوك (عام)",
		guide: "   {pn} <url video/story>: تنزيل الفيديو من فيسبوك",
		text: {
			missingUrl: "الرجاء إدخال رابط الفيديو/القصة (العام) على فيسبوك الذي تريد تنزيله",
			error: "حدث خطأ أثناء تنزيل الفيديو",
			downloading: "جاري تنزيل الفيديو لك",
			tooLarge: "عذرًا، لا يمكننا تنزيل الفيديو لك لأن الحجم أكبر من 83 ميغابايت"
		}
	},
	warn: {
		description: "تحذير عضو في المجموعة، إذا حصلوا على 3 تحذيرات، فسيتم حظرهم",
		guide: "   {pn} @tag <السبب>: تحذير عضو\n   {pn} list: عرض قائمة الأعضاء المحذرين\n   {pn} listban: عرض قائمة الأعضاء المحظورين\n   {pn} info [@tag | <uid> | اترك فارغًا]: عرض معلومات التحذير للعضو المشار إليه أو uid أو نفسك\n   {pn} unban <uid>: إلغاء حظر العضو بواسطة uid\n   {pn} unwarn <uid> [<رقم التحذير> | اترك فارغًا]: إلغاء تحذير العضو بواسطة uid ورقم التحذير\n   {pn} warn reset: إعادة تعيين جميع بيانات التحذير\n⚠️ تحتاج إلى تعيين البوت كمسؤول للطرد التلقائي للأعضاء المحظورين",
		text: {
			list: "قائمة الأعضاء الذين تم تحذيرهم:\n%1\n\nلعرض تفاصيل التحذيرات، استخدم الأمر \"%2warn info [@tag | <uid> | اترك فارغًا]\": لعرض معلومات التحذير للشخص المشار إليه أو uid أو نفسك",
			listBan: "قائمة الأعضاء الذين تم تحذيرهم 3 مرات وتم حظرهم من الصندوق:\n%1",
			listEmpty: "مجموعتك لا تحتوي على أعضاء تم تحذيرهم",
			listBanEmpty: "مجموعتك لا تحتوي على أعضاء محظورين من الصندوق",
			invalidUid: "الرجاء إدخال uid صالح للشخص الذي تريد عرض معلوماته",
			noData: "لا توجد بيانات",
			noPermission: "❌ يمكن لمسؤولي المجموعة فقط إلغاء حظر الأعضاء المحظورين من الصندوق",
			invalidUid2: "⚠️ الرجاء إدخال uid صالح للشخص الذي تريد إلغاء حظره",
			notBanned: "⚠️ المستخدم بالمعرف %1 لم يتم حظره من صندوقك",
			unbanSuccess: "✅ تم إلغاء حظر العضو [%1 | %2] بنجاح، حاليًا يمكن لهذا الشخص الانضمام إلى صندوق الدردشة الخاص بك",
			noPermission2: "❌ يمكن لمسؤولي المجموعة فقط إزالة التحذيرات من الأعضاء في المجموعة",
			invalidUid3: "⚠️ الرجاء إدخال uid أو الإشارة إلى الشخص الذي تريد إزالة التحذير منه",
			noData2: "⚠️ المستخدم بالمعرف %1 ليس لديه بيانات تحذير",
			notEnoughWarn: "❌ المستخدم %1 لديه %2 تحذير فقط",
			unwarnSuccess: "✅ تم إزالة التحذير %1 للعضو [%2 | %3] بنجاح",
			noPermission3: "❌ يمكن لمسؤولي المجموعة فقط إعادة تعيين بيانات التحذير",
			resetWarnSuccess: "✅ تم إعادة تعيين بيانات التحذير بنجاح",
			noPermission4: "❌ يمكن لمسؤولي المجموعة فقط تحذير الأعضاء في المجموعة",
			invalidUid4: "⚠️ تحتاج إلى الإشارة إلى الشخص الذي تريد تحذيره أو الرد على رسالته",
			warnSuccess: "⚠️ تم تحذير العضو %1 مرة %2\n- Uid: %3\n- السبب: %4\n- التاريخ والوقت: %5\nتم تحذير هذا العضو 3 مرات وتم حظره من الصندوق، لإلغاء الحظر استخدم الأمر \"%6warn unban <uid>\" (حيث uid هو uid الشخص الذي تريد إلغاء حظره)",
			noPermission5: "⚠️ يحتاج البوت إلى أذونات المسؤول لطرد الأعضاء المحظورين",
			warnSuccess2: "⚠️ تم تحذير العضو %1 مرة %2\n- Uid: %3\n- السبب: %4\n- التاريخ والوقت: %5\nإذا انتهك هذا الشخص %6 مرات أخرى، فسيتم حظره من الصندوق",
			hasBanned: "⚠️ تم تحذير الأعضاء التاليين 3 مرات من قبل وتم حظرهم من الصندوق:\n%1",
			failedKick: "⚠️ حدث خطأ عند طرد الأعضاء التاليين:\n%1"
		}
	},
	weather: {
		description: "عرض توقعات الطقس الحالية والخمسة أيام القادمة",
		guide: "{pn} <الموقع>",
		text: {
			syntaxError: "الرجاء إدخال موقع",
			notFound: "لم يتم العثور على الموقع: %1",
			error: "حدث خطأ: %1",
			today: "طقس اليوم:\n%1\n🌡 درجة الحرارة المنخفضة - العالية %2°C - %3°C\n🌡 درجة الحرارة المحسوسة %4°C - %5°C\n🌅 شروق الشمس %6\n🌄 غروب الشمس %7\n🌃 شروق القمر %8\n🏙️ غروب القمر %9\n🌞 نهارًا: %10\n🌙 ليلاً: %11"
		}
	},
	ytb: {
		description: "تنزيل الفيديو، الصوت أو عرض معلومات الفيديو على يوتيوب",
		guide: "   {pn} [video|-v] [<اسم الفيديو>|<رابط الفيديو>]: يستخدم لتنزيل الفيديو من يوتيوب.\n   {pn} [audio|-a] [<اسم الفيديو>|<رابط الفيديو>]: يستخدم لتنزيل الصوت من يوتيوب\n   {pn} [info|-i] [<اسم الفيديو>|<رابط الفيديو>]: يستخدم لعرض معلومات الفيديو من يوتيوب\n   مثال:\n    {pn} -v Fallen Kingdom\n    {pn} -a Fallen Kingdom\n    {pn} -i Fallen Kingdom",
		text: {
			error: "حدث خطأ: %1",
			noResult: "لا توجد نتائج بحث تطابق الكلمة الرئيسية %1",
			choose: "%1الرد على الرسالة بالرقم للاختيار أو أي محتوى للإلغاء",
			downloading: "جاري تنزيل الفيديو %1",
			noVideo: "عذرًا، لم يتم العثور على فيديو بحجم أقل من 83 ميغابايت",
			downloadingAudio: "جاري تنزيل الصوت %1",
			noAudio: "عذرًا، لم يتم العثور على صوت بحجم أقل من 26 ميغابايت",
			info: "💠 العنوان: %1\n🏪 القناة: %2\n👨‍👩‍👧‍👦 المشتركون: %3\n⏱ مدة الفيديو: %4\n👀 المشاهدات: %5\n👍 الإعجابات: %6\n🆙 تاريخ الرفع: %7\n🔠 المعرف: %8\n🔗 الرابط: %9",
			listChapter: "\n📖 قائمة الفصول: %1\n"
		}
	}
};